app/controllers/assignments_controller.rb

    def create
        @assignment = Assignment.create!(params[:assignment])
---
INSERT INTO "assignments" ("description", "dueDate", "percentGrade", "points", "possiblePoints", "title") VALUES (?, ?, ?, ?, ?, ?)  [["description", "Rawr"], ["dueDate", "2013-11-27"], ["percentGrade", 0], ["points", 0], ["possiblePoints", 100], ["title", "woof"]]

    def show
        id = params[:id]
        @assignment = Assignment.find(id)
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "show"]]

    def destroy
        @assignment = Assignment.find(params[:id])
        @assignment.destroy
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 1]]